package homeLesson4;

//Вывести на экран первые 10 элементов последовательности 2 4 6 8 10 и тд

public class Task1 {

    public static void main(String[] args) {

        for (int i = 1; i <= 10 * 2; i++)

            System.out.println(++i);


    }
}
