package homeLesson1;

public class HomeLesson01 {

//    Создать новый локальный репозиторий, в нем 3 файла
//Зафиксировать изменения
//Один файл удалить, второй переименовать, третий отредактировать
// Зафиксировать изменения
// Создать файл .gitignore и еще раз зафиксировать изменения.
//  Все изменения отправить в новый удаленный репозиторий
// Прислать мне личным сообщением ссылку на удаленный репозиторий + свои имя и фамилию
    public static void main(String[] args) {
        System.out.println("Домашнее задание");
    }
}
